export default [
  {
    id: "nq1",
    text: "딸기가 직장에서 해고되면?",
    answers: [
      "딸기시럽", // 정답
      "딸기잼",
      "딸기우유",
      "딸기케이크",
    ],
  },
  {
    id: "nq2",
    text: "왕이 양쪽에 있으면?",
    answers: [
      "우왕좌왕", // 정답
      "왕좌의 게임",
      "왕복",
      "왕왕",
    ],
  },
  {
    id: "nq3",
    text: "빵이 목장에 간 이유는?",
    answers: [
      "소보로", // 정답
      "우유빵",
      "버터롤",
      "크림빵",
    ],
  },
  {
    id: "nq4",
    text: "차를 발로 차면?",
    answers: [
      "카놀라유", // 정답
      "카페라떼",
      "카카오",
      "카레",
    ],
  },
  {
    id: "nq5",
    text: "한 입 베어먹은 사과는?",
    answers: [
      "파인애플", // 정답
      "사과파이",
      "애플파이",
      "사과잼",
    ],
  },
  {
    id: "nq6",
    text: "서울에 한파가 찾아오면?",
    answers: [
      "서울시립대", // 정답
      "서울냉장고",
      "서울빙판",
      "서울냉동",
    ],
  },
  {
    id: "nq7",
    text: "신사가 자기소개할 때 쓰는 말은?",
    answers: [
      "신사임당", // 정답
      "신사동",
      "신사복",
      "신사모",
    ],
  },
  {
    id: "nq8",
    text: "세상에서 가장 뜨거운 과일은?",
    answers: [
      "천도복숭아", // 정답
      "핫도그",
      "불닭",
      "열매",
    ],
  },
  {
    id: "nq9",
    text: "우유가 넘어지면?",
    answers: [
      "아야", // 정답
      "우유병",
      "흘림",
      "넘어짐",
    ],
  },
  {
    id: "nq10",
    text: "초밥이 이에 끼면?",
    answers: [
      "ESC", // 정답
      "초밥칫솔",
      "이쑤시개",
      "스시칫솔",
    ],
  },
];
